Repository: risk-place-angola/mobile-risk-place
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Login
pt: Entrar

source: Register
pt: Cadastrar

source: Phone
pt: Telefone

source: Password
pt: Senha

source: Confirm password
pt: Confirmar senha

source: Name
pt: Nome

source: Forgot password?
pt: Esqueceu a senha?

# dontHaveAccount
source: Don't have an account?
pt: Não tem uma conta?

source: Sign up
pt: Cadastre-se

# alreadyHaveAccount
source: Already have an account?
pt: Já tem uma conta?

source: Sign in
pt: Entre

source: or
pt: ou

source: Email or Phone
pt: Email ou Telefone

# enterEmailOrPhone
source: Enter your email or phone
pt: Digite seu email ou telefone

# enterEmail
source: Enter your email
pt: Digite seu email

# enterPassword
source: Enter your password
pt: Digite sua senha

# enterName
source: Enter your name
pt: Digite seu nome

# enterPhone
source: Enter your phone
pt: Digite seu telefone

source: Invalid email
pt: Email inválido

# passwordTooShort
source: Password must have at least 6 characters
pt: Senha deve ter no mínimo 6 caracteres

source: Passwords don't match
pt: Senhas não conferem

# fieldRequired
source: This field is required
pt: Este campo é obrigatório

source: Verification Code
pt: Código de Verificação

# verificationCodeSent
source: We sent a code to {email}
pt: Enviamos um código para {email}

# verificationCodeMessage
source: Check your phone or email for the verification code
pt: Verifique seu telefone ou email pelo código de verificação

source: Confirm
pt: Confirmar

source: Resend code
pt: Reenviar código

# accountConfirmed
source: Account confirmed successfully!
pt: Conta confirmada com sucesso!

source: Error confirming code
pt: Erro ao confirmar código

# codeResentSuccess
source: Code resent successfully!
pt: Código reenviado com sucesso!

source: Code sent to email
pt: Código enviado para o email

# smsFailed
source: SMS failed. Check your email
pt: Falha no SMS. Verifique seu email

# codeSentTo
source: Code sent to {contact}
pt: Código enviado para {contact}

source: Error resending code
pt: Erro ao reenviar código

# verificationCodeExpired
source: Verification code expired. Request a new one.
pt: Código de verificação expirado. Solicite um novo.

# invalidVerificationCode
source: Invalid verification code. Please check and try again.
pt: Código de verificação inválido. Verifique e tente novamente.

source: Failed to confirm registration
pt: Falha ao confirmar cadastro

# verificationCodeTitle
source: Verification Code
pt: Verificação de Código

# verificationAttemptsLeft
source: {attempts} attempts left
pt: {attempts} tentativas restantes

# verificationAccountLocked
source: Too many attempts. Wait {minutes} minutes
pt: Muitas tentativas. Aguarde {minutes} minutos

# verificationResendIn
source: Resend in {seconds}s
pt: Reenviar em {seconds}s

# verificationCodeExpiresIn
source: Code expires in {minutes}:{seconds}
pt: Código expira em {minutes}:{seconds}

# verificationWaitBeforeResend
source: Wait {seconds} seconds before resending
pt: Aguarde {seconds} segundos antes de reenviar

# verificationTooManyAttempts
source: Too many incorrect attempts. Wait 15 minutes
pt: Muitas tentativas incorretas. Aguarde 15 minutos

# verificationCodeSentTo
source: Code sent to {contact}
pt: Código enviado para {contact}

source: Clear
pt: Limpar

# errorInvalidCredentials
source: Invalid email or password. Please check and try again.
pt: Email ou senha inválidos. Verifique e tente novamente.

# errorAccountNotVerified
source: Your account is not verified. Please check your phone or email for the verification code.
pt: Sua conta não está verificada. Verifique seu telefone ou email pelo código de verificação.

# errorSessionExpired
source: Your session has expired. Please log in again.
pt: Sua sessão expirou. Por favor, faça login novamente.

# errorNoPermission
source: You do not have permission to perform this action.
pt: Você não tem permissão para realizar esta ação.

# errorNotFound
source: The requested information was not found.
pt: As informações solicitadas não foram encontradas.

# errorNoInternet
source: No internet connection. Check your connection and try again.
pt: Sem conexão com a internet. Verifique sua conexão e tente novamente.

# errorTimeout
source: The operation is taking too long. Check your connection and try again.
pt: A operação está demorando muito. Verifique sua conexão e tente novamente.

# errorServerUnavailable
source: Our servers are temporarily unavailable. Please try again shortly.
pt: Nossos servidores estão temporariamente indisponíveis. Tente novamente em alguns instantes.

# errorInvalidData
source: The data sent is invalid. Please check and try again.
pt: Os dados enviados são inválidos. Verifique e tente novamente.

# errorUnexpected
source: An unexpected error occurred. Please try again.
pt: Ocorreu um erro inesperado. Por favor, tente novamente.

# errorGeneric
source: Something went wrong. Please try again later.
pt: Algo deu errado. Por favor, tente novamente mais tarde.

# forgotPasswordTitle
source: Forgot your password?
pt: Esqueceu sua senha?

# forgotPasswordSubtitle
source: Enter your email or phone to receive the recovery code
pt: Digite seu email ou telefone para receber o código de recuperação

source: Send code
pt: Enviar código

# invalidIdentifier
source: Enter a valid email or phone number
pt: Digite um email ou telefone válido

# identifierRequired
source: Email or phone is required
pt: Email ou telefone é obrigatório

# codeSentSuccess
source: Code sent to your email!
pt: Código enviado para seu email!

source: Error sending code
pt: Erro ao enviar código

source: New Password
pt: Nova Senha

# newPasswordSubtitle
source: Enter the code received and your new password
pt: Digite o código recebido e sua nova senha

# verificationCodeLabel
source: Verification code
pt: Código de verificação

# newPasswordLabel
source: New password
pt: Nova senha

# confirmPasswordLabel
source: Confirm password
pt: Confirmar senha

source: Reset password
pt: Redefinir senha

# passwordChangedSuccess
source: Password changed successfully!
pt: Senha alterada com sucesso!

source: Error resetting password
pt: Erro ao redefinir senha

# enterVerificationCode
source: Enter the code
pt: Digite o código

# codeMustBe6Digits
source: Code must have 6 digits
pt: Código deve ter 6 dígitos

# enterNewPassword
source: Enter the new password
pt: Digite a nova senha

source: Profile
pt: Perfil

source: Logout
pt: Sair

source: Edit
pt: Editar

# personalInfo
source: Personal Information
pt: Informações Pessoais

# contactInfo
source: Contact Information
pt: Informações de Contato

source: Loading...
pt: Carregando...

source: Error
pt: Erro

source: Success
pt: Sucesso

source: Cancel
pt: Cancelar

source: Save
pt: Salvar

source: Delete
pt: Excluir

source: Yes
pt: Sim

source: No
pt: Não

source: My Location
pt: Minha Localização

source: Search
pt: Buscar

source: Home
pt: Casa

source: Work
pt: Trabalho

source: Safe Route
pt: Rota Segura

source: Share Location
pt: Compartilhar Localização

source: Emergency Contacts
pt: Contatos de Emergência

source: My Alerts
pt: Meus Alertas

source: Report Risk
pt: Reportar Risco

source: Risk Types
pt: Tipos de Risco

source: Accident
pt: Acidente

source: Natural Disaster
pt: Desastre Natural

source: Fire
pt: Incêndio

source: Health
pt: Saúde

source: Infrastructure
pt: Infraestrutura

source: Environment
pt: Meio Ambiente

source: Violence
pt: Violência

source: Public Safety
pt: Segurança Pública

source: Traffic
pt: Trânsito

source: Urban Issue
pt: Problema Urbano

# riskTopicRobber
source: Theft
pt: Roubo

# riskTopicAssault
source: Assault
pt: Assalto

# riskTopicTheft
source: Pickpocketing
pt: Furtos

# riskTopicVandalism
source: Vandalism
pt: Vandalismo

# riskTopicTrafficAccident
source: Traffic Accident
pt: Acidente de Trânsito

# riskTopicWorkAccident
source: Work Accident
pt: Acidente de Trabalho

# riskTopicFall
source: Fall
pt: Queda

# riskTopicFlood
source: Flood
pt: Enchente

# riskTopicLandslide
source: Landslide
pt: Deslizamento

# riskTopicStorm
source: Storm
pt: Tempestade

# riskTopicForestFire
source: Forest Fire
pt: Incêndio Florestal

# riskTopicInfectiousDisease
source: Infectious Disease
pt: Doença Infecciosa

# riskTopicMedicalEmergency
source: Medical Emergency
pt: Emergência Médica

# riskTopicBridgeCollapse
source: Bridge Collapse
pt: Queda de Ponte

# riskTopicPowerOutage
source: Power Outage
pt: Queda de Energia

# riskTopicPollution
source: Pollution
pt: Poluição

# riskTopicChemicalLeak
source: Chemical Leak
pt: Vazamento Químico

# assalto_mao_armada
source: Armed Robbery
pt: Assalto à Mão Armada

# roubo_residencia
source: Residential Theft
pt: Roubo em Residência

# roubo_veiculo
source: Vehicle Theft
pt: Roubo de Veículo

# furto_carteira
source: Wallet Theft
pt: Furto de Carteira

# furto_telemovel
source: Phone Theft
pt: Furto de Telemóvel

# vandalismo
source: Vandalism
pt: Vandalismo

# sequestro
source: Kidnapping
pt: Sequestro

# violencia_domestica
source: Domestic Violence
pt: Violência Doméstica

# agressao_fisica
source: Physical Assault
pt: Agressão Física

# tiroteio
source: Shooting
pt: Tiroteio

# acidente_viacao
source: Car Accident
pt: Acidente de Viação

# colisao_transito
source: Collision
pt: Colisão

# atropelamento
source: Pedestrian Hit
pt: Atropelamento

# capotamento
source: Vehicle Rollover
pt: Capotamento

# inundacao
source: Flooding
pt: Inundação

# deslizamento_terra
source: Landslide
pt: Deslizamento de Terra

# tempestade
source: Storm
pt: Tempestade

# raio
source: Lightning Strike
pt: Queda de Raio

# incendio_residencial
source: Residential Fire
pt: Incêndio Residencial

# incendio_comercial
source: Commercial Fire
pt: Incêndio Comercial

# incendio_mercado
source: Market Fire
pt: Incêndio em Mercado

# incendio_veiculo
source: Vehicle Fire
pt: Veículo em Chamas

# emergencia_medica
source: Medical Emergency
pt: Emergência Médica

# surto_doenca
source: Disease Outbreak
pt: Surto de Doença

# acidente_trabalho
source: Work Accident
pt: Acidente de Trabalho

# queda_energia
source: Power Outage
pt: Falta de Energia

# queda_agua
source: Water Outage
pt: Falta de Água

# buraco_via
source: Pothole
pt: Buraco na Via

# semaforo_avariado
source: Broken Traffic Light
pt: Semáforo Avariado

# cabo_solto
source: Loose Cable
pt: Cabo Elétrico Solto

# estrutura_risco
source: Structure at Risk
pt: Estrutura em Risco

# lixo_acumulado
source: Garbage Accumulation
pt: Lixo Acumulado

# esgoto_aberto
source: Open Sewage
pt: Esgoto Aberto

# poluicao_ar
source: Air Pollution
pt: Poluição do Ar

# vazamento_agua
source: Water Leak
pt: Vazamento de Água

# rua_escura
source: Dark Street
pt: Rua Escura

# zona_assalto
source: Robbery Zone
pt: Zona de Assalto

# vigilancia_necessaria
source: Police Needed
pt: Vigilância Necessária

# operacao_policial
source: Police Operation
pt: Operação Policial

# congestionamento
source: Traffic Jam
pt: Congestionamento

# via_bloqueada
source: Blocked Road
pt: Via Bloqueada

# manifestacao
source: Protest
pt: Manifestação

# animal_solto
source: Loose Animal
pt: Animal Solto

# obra_sinalizacao
source: Unsigned Construction
pt: Obra Sem Sinalização

# assalto
source: Robbery
pt: Assalto

# furtos
source: Thefts
pt: Furtos

# roubo
source: Theft
pt: Roubo

# queda
source: Fall
pt: Queda

# enchente
source: Flood
pt: Enchente

# deslizamento
source: Landslide
pt: Deslizamento

# incendio_florestal
source: Forest Fire
pt: Incêndio Florestal

# doenca_infecciosa
source: Infectious Disease
pt: Doença Infecciosa

# queda_ponte
source: Bridge Collapse
pt: Queda de Ponte

# poluicao
source: Pollution
pt: Poluição

# vazamento_quimico
source: Chemical Leak
pt: Vazamento Químico

# acidente_transito
source: Traffic Accident
pt: Acidente de Trânsito

source: Search Radius
pt: Raio de Busca

source: Search Location
pt: Buscar Localização

source: Recent
pt: Recentes

source: More Options
pt: Mais Opções

source: Saved Places
pt: Lugares Salvos

# savedPlacesSubtitle
source: Quick access to your locations
pt: Acesso rápido às suas localizações

source: Share My Location
pt: Compartilhar Minha Localização

# shareMyLocationSubtitle
source: Send location to family & friends
pt: Enviar localização para família e amigos

source: Check Safe Route
pt: Verificar Rota Segura

# checkSafeRouteSubtitle
source: Find the safest path
pt: Encontre o caminho mais seguro

source: Edit Alert
pt: Editar Alerta

# updateAlertMessage
source: Update the message, severity or radius of the alert.
pt: Atualize a mensagem, gravidade ou raio do alerta.

source: Message
pt: Mensagem

source: Describe the alert
pt: Descreva o alerta

# messageRequired
source: Message is required
pt: Mensagem é obrigatória

source: Severity
pt: Gravidade

source: Radius
pt: Raio

source: Radius (meters)
pt: Raio (metros)

# radiusRequired
source: Radius is required
pt: Raio é obrigatório

source: Invalid value
pt: Valor inválido

# radiusMustBeBetween
source: Radius must be between 100 and 10,000m
pt: Raio deve estar entre 100 e 10.000m

# changesWillBeApplied
source: Changes will be applied immediately and subscribers will be notified.
pt: As alterações serão aplicadas imediatamente e os inscritos serão notificados.

source: Add Contact
pt: Adicionar Contato

source: Edit Contact
pt: Editar Contato

# configureEmergencyContact
source: Configure an emergency contact to be notified in critical situations.
pt: Configure um contato de emergência para ser notificado em situações críticas.

# nameRequired
source: Name is required
pt: Nome é obrigatório

# phoneRequired
source: Phone is required
pt: Telefone é obrigatório

source: Relation
pt: Relação

source: Priority
pt: Prioridade

source: Priority contact
pt: Contato prioritário

# willReceiveEmergencyAlerts
source: Will receive automatic emergency alerts
pt: Receberá alertas de emergência automáticos

source: Add
pt: Adicionar

source: Report at my location
pt: Reportar na minha localização

source: Use current GPS location
pt: Usar localização atual do GPS

source: Choose location on map
pt: Escolher localização no mapa

source: Adjust manually on map
pt: Ajustar manualmente no mapa

source: Report
pt: Reportar

source: Try Again
pt: Tentar Novamente

source: Created by Me
pt: Criados por Mim

source: Subscribed
pt: Inscritos

source: Confirm Deletion
pt: Confirmar Exclusão

source: Confirm Cancellation
pt: Confirmar Cancelamento

# areYouSureDelete
source: Are you sure you want to delete this alert?
pt: Tem certeza que deseja excluir este alerta?

# areYouSureCancelSubscription
source: Are you sure you want to cancel subscription to this alert?
pt: Tem certeza que deseja cancelar a inscrição neste alerta?

source: Unsubscribe
pt: Cancelar Inscrição

source: Alert Radius
pt: Raio de Alertas

source: Report Radius
pt: Raio de Relatórios

source: All Reports
pt: Todos os Relatórios

source: Error loading reports
pt: Erro ao carregar relatórios

source: Select Destination
pt: Selecionar Destino

source: Select on Map
pt: Selecionar no Mapa

source: Confirm Destination
pt: Confirmar Destino

source: Remove Contact
pt: Remover Contato

source: Remove
pt: Remover

source: Safety Settings
pt: Configurações de Segurança

source: Notifications Enabled
pt: Notificações Ativadas

source: Receive all notifications
pt: Receber todas as notificações

source: Alert Types
pt: Tipos de Alerta

source: Report Types
pt: Tipos de Relatório

source: Location Sharing
pt: Compartilhamento de Localização

# shareLocationEmergencies
source: Share location in emergencies
pt: Compartilhar localização em emergências

source: Location History
pt: Histórico de Localizações

# saveLocationHistory
source: Save history of where you've been
pt: Salvar histórico de onde você esteve

source: Profile Visibility
pt: Visibilidade do Perfil

source: Anonymous Reports
pt: Relatórios Anônimos

# dontShowNameReports
source: Don't show your name on reports
pt: Não mostrar seu nome nos relatórios

source: Show Online Status
pt: Mostrar Status Online

# othersCanSeeOnline
source: Others can see if you're online
pt: Outros usuários podem ver se você está online

source: Automatic Alerts
pt: Alertas Automáticos

source: Enable smart automatic alerts
pt: Ativar alertas automáticos inteligentes

source: Danger Zones
pt: Zonas de Perigo

source: Alert when entering risk areas
pt: Alertar ao entrar em áreas de risco

source: Time-based Alerts
pt: Alertas por Horário

# specialAlertsRiskTimes
source: Special alerts during risk times
pt: Alertas especiais em horários de risco

source: Start Time
pt: Horário de Início

source: End Time
pt: Horário de Término

source: Automatic Night Mode
pt: Modo Noturno Automático

source: Enable automatically at night
pt: Ativar automaticamente à noite

source: Night Mode Start
pt: Início do Modo Noturno

source: Night Mode End
pt: Término do Modo Noturno

source: Close
pt: Fechar

source: More Details
pt: Mais Detalhes

source: View Details
pt: Ver Detalhes

source: Edit Location
pt: Editar Localização

source: Delete Place
pt: Excluir Local

source: Sharing Location
pt: Compartilhando Localização

source: Stop Sharing
pt: Parar Compartilhamento

# stopSharingConfirm
source: Stop Sharing
pt: Parar

source: Share
pt: Compartilhar

source: Copy Link
pt: Copiar Link

source: Place Name
pt: Nome do Local

source: Category
pt: Categoria

# describeAlert
source: Describe the alert
pt: Descreva o alerta

source: Full Name
pt: Nome Completo

# enterFullName
source: Enter your full name
pt: Digite seu nome completo

source: Mark as priority
pt: Marcar como prioritário

source: Receive automatic emergency alerts
pt: Receberá alertas de emergência automáticos

source: Range of Reach
pt: Raio de Alcance

source: 🚨 EMERGENCY ALERT
pt: 🚨 ALERTA DE EMERGÊNCIA

source: Reach Radius
pt: Raio de Alcance

# timeLabel
source: Time
pt: Horário

source: Now
pt: Agora

# minutesAgo
source: {minutes} min ago
pt: Há {minutes} min

# hoursAgo
source: {hours}h ago
pt: Há {hours}h

source: 📍 COMMUNITY REPORT
pt: 📍 REPORT DA COMUNIDADE

source: Verified
pt: Verificado

source: Resolved
pt: Resolvido

source: Reported
pt: Reportado

source: Pending
pt: Pendente

source: Tracking
pt: Rastreamento

source: Privacy
pt: Privacidade

# automaticAlertsSettings
source: Automatic Alerts
pt: Alertas Automáticos

source: Night Mode
pt: Modo Noturno

source: Notifications
pt: Notificações

source: None selected
pt: Nenhum selecionado

source: Create Account
pt: Criar Conta

# fillDataBelow
source: Fill in the data below
pt: Preencha os dados abaixo

# fullNameLabel
source: Full Name
pt: Nome Completo

# enterFullNamePlaceholder
source: Enter your full name
pt: Digite seu nome completo

# enterEmailPlaceholder
source: Enter your email
pt: Digite seu email

# enterPhonePlaceholder
source: Enter your phone
pt: Digite seu telefone

# enterPasswordPlaceholder
source: Enter your password
pt: Digite sua senha

source: I am RFCE
pt: Sou RFCE

# registerButton
source: Register
pt: Registrar-se

# alreadyHaveAccountQuestion
source: Already have an account?
pt: Já tem uma conta?

# sentCodeTo
source: We sent a code to {email}
pt: Enviamos um código para {email}

source: Edit Profile
pt: Editar Perfil

source: What do you see?
pt: O que você vê?

source: Select specific type
pt: Selecione o tipo específico

# helloUser
source: Hello, {name}!
pt: Olá, {name}!

source: Welcome!
pt: Bem-vindo!

# loginOrRegister
source: Login / Register
pt: Entrar / Registrar

source: View Profile
pt: Ver perfil

# viewAlertsPostedOrSubscribed
source: View alerts you posted or subscribed to
pt: Ver alertas que você publicou ou inscreveu

source: View all system reports
pt: Ver todos os relatórios do sistema

# emergencyContactsTitle
source: Emergency Contacts
pt: Contatos de Emergência

source: Manage trusted contacts
pt: Gerenciar contatos confiáveis

# safetySettingsTitle
source: Safety Settings
pt: Configurações de Segurança

source: Notifications, tracking, privacy
pt: Notificações, rastreamento, privacidade

source: Community & Feedback
pt: Comunidade & Feedback

# sendFeedbackReadUpdates
source: Send feedback or read updates
pt: Enviar feedback ou ler atualizações

source: My Profile
pt: Meu Perfil

source: Edit personal info & preferences
pt: Editar informações e preferências pessoais

source: Enable Notifications
pt: Ativar Notificações

# receiveUrgentSafetyAlerts
source: Receive urgent safety alerts in real-time
pt: Receber alertas urgentes de segurança em tempo real

source: Turn on now
pt: Ativar agora

source: Not informed
pt: Não informado

# voteConfirmed
source: Thank you for confirming!
pt: Obrigado por confirmar!

# voteFeedbackReceived
source: Feedback received
pt: Feedback recebido

# voteErrorTitle
source: Unable to vote
pt: Não foi possível votar

# voteErrorMessage
source: We couldn't process your vote. Please try again.
pt: Não conseguimos processar seu voto. Por favor, tente novamente.

# voteErrorNetwork
source: Connection error. Check your internet and try again.
pt: Erro de conexão. Verifique sua internet e tente novamente.

# voteErrorServer
source: Server error. Please try again later.
pt: Erro no servidor. Por favor, tente novamente mais tarde.

# voteErrorUnauthorized
source: You must be logged in to vote.
pt: Você precisa estar logado para votar.

source: Set Home
pt: Configurar Casa

source: Set Work
pt: Configurar Trabalho

source: Search address...
pt: Buscar endereço...

source: Error searching address
pt: Erro ao buscar endereço

# pleaseSelectAddress
source: Please select an address
pt: Por favor, selecione um endereço

# errorSavingAddress
source: Error saving address: {error}
pt: Erro ao salvar endereço: {error}

# selected
source: Selected: {address}
pt: Selecionado: {address}

source: Fill all fields!
pt: Preencha todos os campos!

source: Login Successful!
pt: Login Realizado!

source: Welcome back
pt: Bem-vindo de volta

# verifiedBadge
source: Verified
pt: Verificado

# unreliableBadge
source: Unreliable
pt: Não confiável

# confirmsBadge
source: {count} confirm
pt: {count} confirmam

# tryAgainButton
source: Try Again
pt: Tentar novamente

# unsubscribeButton
source: Unsubscribe
pt: Cancelar Inscrição

source: Subscribe
pt: Inscrever

# confirmDestinationButton
source: Confirm Destination
pt: Confirmar Destino

source: Error calculating route
pt: Erro ao calcular rota

# errorSendingSMS
source: Error sending SMS: {error}
pt: Erro ao enviar SMS: {error}

# errorRegisterCheckCredentials
source: Error registering. Check your credentials.
pt: Erro ao registrar. Verifique suas credenciais.

source: Location permission denied
pt: Permissão de localização negada

source: Could not get location
pt: Não foi possível obter a localização

# locationStreamError
source: Location stream error: {error}
pt: Erro no stream de localização: {error}

source: Add Safe Place
pt: Adicionar Lugar Seguro

# safeRouteButton
source: Safe Route
pt: Rota Segura

source: Waiting location...
pt: Aguardando localização...

# waitingGPS
source: Waiting GPS location...
pt: Aguardando localização GPS...

# homeAddressSavedSuccess
source: Home address saved successfully!
pt: Endereço de casa salvo com sucesso!

# workAddressSavedSuccess
source: Work address saved successfully!
pt: Endereço de trabalho salvo com sucesso!

# addedSuccessfully
source: {name} added successfully!
pt: {name} adicionado com sucesso!
